Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: وليحملن أثقالهم وأثقالا مع أثقالهم وليسألن يوم القيامة عما كانوا يفترون
en: But they verily will bear their own loads and other loads beside their own, and they verily will be questioned on the Day of Resurrection concerning that which they invented.

source: ولقد أرسلنا نوحا إلى قومه فلبث فيهم ألف سنة إلا خمسين عاما فأخذهم الطوفان وهم ظالمون
en: And verily we sent Noah (as Our messenger) unto his folk, and he continued with them for a thousand years save fifty years; and the flood engulfed them, for they were wrong-doers.

source: فأنجيناه وأصحاب السفينة وجعلناها آية للعالمين
en: And We rescued him and those with him in the ship, and made of it a portent for the peoples.

source: وإبراهيم إذ قال لقومه اعبدوا الله واتقوه ذلكم خير لكم إن كنتم تعلمون
en: And Abraham! (Remember) when he said unto his folk: Serve Allah, and keep your duty unto Him; that is better for you if ye did but know.

source: إنما تعبدون من دون الله أوثانا وتخلقون إفكا إن الذين تعبدون من دون الله لا يملكون لكم رزقا فابتغوا عند الله الرزق واعبدوه واشكروا له إليه ترجعون
en: Ye serve instead of Allah only idols, and ye only invent a lie. Lo! those whom ye serve instead of Allah own no provision for you. So seek your provision from Allah, and serve Him, and give thanks unto Him, (for) unto Him ye will be brought back.

source: وإن تكذبوا فقد كذب أمم من قبلكم وما على الرسول إلا البلاغ المبين
en: But if ye deny, then nations have denied before you. The messenger is only to convey (the message) plainly.

source: أولم يروا كيف يبدئ الله الخلق ثم يعيده إن ذلك على الله يسير
en: See they not how Allah produceth creation, then reproduceth it? Lo! for Allah that is easy.

source: قل سيروا في الأرض فانظروا كيف بدأ الخلق ثم الله ينشئ النشأة الآخرة إن الله على كل شيء قدير
en: Say (O Muhammad): Travel in the land and see how He originated creation, then Allah bringeth forth the later growth. Lo! Allah is Able to do all things.

source: يعذب من يشاء ويرحم من يشاء وإليه تقلبون
en: He punisheth whom He will and showeth mercy unto whom He will, and unto Him ye will be turned.

source: وما أنتم بمعجزين في الأرض ولا في السماء وما لكم من دون الله من ولي ولا نصير
en: Ye cannot escape (from Him) in the earth or in the sky, and beside Allah there is for you no friend or helper.

source: والذين كفروا بآيات الله ولقائه أولئك يئسوا من رحمتي وأولئك لهم عذاب أليم
en: Those who disbelieve in the revelations of Allah and in (their) Meeting with Him, such have no hope of My mercy. For such there is a painful doom.

source: فما كان جواب قومه إلا أن قالوا اقتلوه أو حرقوه فأنجاه الله من النار إن في ذلك لآيات لقوم يؤمنون
en: But the answer of his folk was only that they said: "Kill him" or "Burn him." Then Allah saved him from the Fire. Lo! herein verily are portents for folk who believe.

source: وقال إنما اتخذتم من دون الله أوثانا مودة بينكم في الحياة الدنيا ثم يوم القيامة يكفر بعضكم ببعض ويلعن بعضكم بعضا ومأواكم النار وما لكم من ناصرين
en: He said: Ye have chosen only idols instead of Allah. The love between you is only in the life of the world. Then on the Day of Resurrection ye will deny each other and curse each other, and your abode will be the Fire, and ye will have no helpers.

source: فآمن له لوط وقال إني مهاجر إلى ربي إنه هو العزيز الحكيم
en: And Lot believed him, and said: Lo! I am a fugitive unto my Lord. Lo! He, only He, is the Mighty, the Wise.

source: ووهبنا له إسحاق ويعقوب وجعلنا في ذريته النبوة والكتاب وآتيناه أجره في الدنيا وإنه في الآخرة لمن الصالحين
en: And We bestowed on him Isaac and Jacob, and We established the prophethood and the Scripture among his seed, and We gave him his reward in the world, and lo! in the Hereafter he verily is among the righteous.

source: ولوطا إذ قال لقومه إنكم لتأتون الفاحشة ما سبقكم بها من أحد من العالمين
en: And Lot! (Remember) when he said unto his folk: Lo! ye commit lewdness such as no creature did before you.

source: أئنكم لتأتون الرجال وتقطعون السبيل وتأتون في ناديكم المنكر فما كان جواب قومه إلا أن قالوا ائتنا بعذاب الله إن كنت من الصادقين
en: For come ye not in unto males, and cut ye not the road (for travellers), and commit ye not abomination in your meetings? But the answer of his folk was only that they said: Bring Allah's doom upon us if thou art a truthteller!

source: قال رب انصرني على القوم المفسدين
en: He said: My Lord! Give me victory over folk who work corruption.

source: ولما جاءت رسلنا إبراهيم بالبشرى قالوا إنا مهلكو أهل هذه القرية إن أهلها كانوا ظالمين
en: And when Our messengers brought Abraham the good news, they said: Lo! we are about to destroy the people of that township, for its people are wrong-doers.

source: قال إن فيها لوطا قالوا نحن أعلم بمن فيها لننجينه وأهله إلا امرأته كانت من الغابرين
en: He said: Lo! Lot is there. They said: We are best aware of who is there. We are to deliver him and his household, all save his wife, who is of those who stay behind.

source: ولما أن جاءت رسلنا لوطا سيء بهم وضاق بهم ذرعا وقالوا لا تخف ولا تحزن إنا منجوك وأهلك إلا امرأتك كانت من الغابرين
en: And when Our messengers came unto Lot, he was troubled upon their account, for he could not protect them; but they said: Fear not, nor grieve! Lo! we are to deliver thee and thy household, (all) save thy wife, who is of those who stay behind.

source: إنا منزلون على أهل هذه القرية رجزا من السماء بما كانوا يفسقون
en: Lo! We are about to bring down upon the folk of this township a fury from the sky because they are evil-livers.

source: ولقد تركنا منها آية بينة لقوم يعقلون
en: And verily of that We have left a clear sign for people who have sense.

source: وإلى مدين أخاهم شعيبا فقال يا قوم اعبدوا الله وارجوا اليوم الآخر ولا تعثوا في الأرض مفسدين
en: And unto Midian We sent Shu'eyb, their brother. He said: O my people! Serve Allah, and look forward to the Last Day, and do not evil, making mischief, in the earth.

source: فكذبوه فأخذتهم الرجفة فأصبحوا في دارهم جاثمين
en: But they denied him, and the dreadful earthquake took them, and morning found them prostrate in their dwelling place.

source: وعادا وثمود وقد تبين لكم من مساكنهم وزين لهم الشيطان أعمالهم فصدهم عن السبيل وكانوا مستبصرين
en: And (the tribes of) A'ad and Thamud! (Their fate) is manifest unto you from their (ruined and deserted) dwellings. Satan made their deeds seem fair unto them and so debarred them from the Way, though they were keen observers.

source: وقارون وفرعون وهامان ولقد جاءهم موسى بالبينات فاستكبروا في الأرض وما كانوا سابقين
en: And Korah, Pharaoh and Haman! Moses came unto them with clear proofs (of Allah's Sovereignty), but they were boastful in the land. And they were not winners (in the race).

source: فكلا أخذنا بذنبه فمنهم من أرسلنا عليه حاصبا ومنهم من أخذته الصيحة ومنهم من خسفنا به الأرض ومنهم من أغرقنا وما كان الله ليظلمهم ولكن كانوا أنفسهم يظلمون
en: So We took each one in his sin; of them was he on whom We sent a hurricane, and of them was he who was overtaken by the (Awful) Cry, and of them was he whom We caused the earth to swallow, and of them was he whom We drowned. It was not for Allah to wrong them, but they wronged themselves.

source: مثل الذين اتخذوا من دون الله أولياء كمثل العنكبوت اتخذت بيتا وإن أوهن البيوت لبيت العنكبوت لو كانوا يعلمون
en: The likeness of those who choose other patrons than Allah is as the likeness of the spider when she taketh unto herself a house, and lo! the frailest of all houses is the spider's house, if they but knew.

source: إن الله يعلم ما يدعون من دونه من شيء وهو العزيز الحكيم
en: Lo! Allah knoweth what thing they invoke instead of Him. He is the Mighty, the Wise.

source: وتلك الأمثال نضربها للناس وما يعقلها إلا العالمون
en: As for these similitudes, We coin them for mankind, but none will grasp their meaning save the wise.

source: خلق الله السماوات والأرض بالحق إن في ذلك لآية للمؤمنين
en: Allah created the heavens and the earth with truth. Lo! therein is indeed a portent for believers.

source: اتل ما أوحي إليك من الكتاب وأقم الصلاة إن الصلاة تنهى عن الفحشاء والمنكر ولذكر الله أكبر والله يعلم ما تصنعون
en: Recite that which hath been inspired in thee of the Scripture, and establish worship. Lo! worship preserveth from lewdness and iniquity, but verily remembrance of Allah is more important. And Allah knoweth what ye do.

source: ولا تجادلوا أهل الكتاب إلا بالتي هي أحسن إلا الذين ظلموا منهم وقولوا آمنا بالذي أنزل إلينا وأنزل إليكم وإلهنا وإلهكم واحد ونحن له مسلمون
en: And argue not with the People of the Scripture unless it be in (a way) that is better, save with such of them as do wrong; and say: We believe in that which hath been revealed unto us and revealed unto you; our Allah and your Allah is One, and unto Him we surrender.

source: وكذلك أنزلنا إليك الكتاب فالذين آتيناهم الكتاب يؤمنون به ومن هؤلاء من يؤمن به وما يجحد بآياتنا إلا الكافرون
en: In like manner We have revealed unto thee the Scripture, and those unto whom We gave the Scripture aforetime will believe therein; and of these (also) there are some who believe therein. And none deny Our revelations save the disbelievers.

source: وما كنت تتلو من قبله من كتاب ولا تخطه بيمينك إذا لارتاب المبطلون
en: And thou (O Muhammad) wast not a reader of any scripture before it, nor didst thou write it with thy right hand, for then might those have doubted, who follow falsehood.

source: بل هو آيات بينات في صدور الذين أوتوا العلم وما يجحد بآياتنا إلا الظالمون
en: But it is clear revelations in the hearts of those who have been given knowledge, and none deny Our revelations save wrong-doers.

source: وقالوا لولا أنزل عليه آيات من ربه قل إنما الآيات عند الله وإنما أنا نذير مبين
en: And they say: Why are not portents sent down upon him from his Lord? Say: Portents are with Allah only, and I am but a plain warner.

source: أولم يكفهم أنا أنزلنا عليك الكتاب يتلى عليهم إن في ذلك لرحمة وذكرى لقوم يؤمنون
en: Is it not enough for them that We have sent down unto thee the Scripture which is read unto them? Lo! herein verily is mercy, and a reminder for folk who believe.

source: قل كفى بالله بيني وبينكم شهيدا يعلم ما في السماوات والأرض والذين آمنوا بالباطل وكفروا بالله أولئك هم الخاسرون
en: Say (unto them, O Muhammad): Allah sufficeth for witness between me and you. He knoweth whatsoever is in the heavens and the earth. And those who believe in vanity and disbelieve in Allah, they it is who are the losers.

source: ويستعجلونك بالعذاب ولولا أجل مسمى لجاءهم العذاب وليأتينهم بغتة وهم لا يشعرون
en: They bid thee hasten on the doom (of Allah). And if a term had not been appointed, the doom would assuredly have come unto them (ere now). And verily it will come upon them suddenly when they perceive not.

source: يستعجلونك بالعذاب وإن جهنم لمحيطة بالكافرين
en: They bid thee hasten on the doom, when lo! hell verily will encompass the disbelievers

source: يوم يغشاهم العذاب من فوقهم ومن تحت أرجلهم ويقول ذوقوا ما كنتم تعملون
en: On the day when the doom will overwhelm them from above them and from underneath their feet, and He will say: Taste what ye used to do!

source: يا عبادي الذين آمنوا إن أرضي واسعة فإياي فاعبدون
en: O my bondmen who believe! Lo! My earth is spacious. Therefor serve Me only.

source: كل نفس ذائقة الموت ثم إلينا ترجعون
en: Every soul will taste of death. Then unto Us ye will be returned.

source: والذين آمنوا وعملوا الصالحات لنبوئنهم من الجنة غرفا تجري من تحتها الأنهار خالدين فيها نعم أجر العاملين
en: Those who believe and do good works, them verily We shall house in lofty dwellings of the Garden underneath which rivers flow. There they will dwell secure. How sweet the guerdon of the toilers,

source: وكأين من دابة لا تحمل رزقها الله يرزقها وإياكم وهو السميع العليم
en: And how many an animal there is that beareth not its own provision! Allah provideth for it and for you. He is the Hearer, the Knower.

source: ولئن سألتهم من خلق السماوات والأرض وسخر الشمس والقمر ليقولن الله فأنى يؤفكون
en: And if thou wert to ask them: Who created the heavens and the earth, and constrained the sun and the moon (to their appointed work)? they would say: Allah. How then are they turned away?

source: الله يبسط الرزق لمن يشاء من عباده ويقدر له إن الله بكل شيء عليم
en: Allah maketh the provision wide for whom He will of His bondmen, and straiteneth it for whom (He will). Lo! Allah is Aware of all things.

source: ولئن سألتهم من نزل من السماء ماء فأحيا به الأرض من بعد موتها ليقولن الله قل الحمد لله بل أكثرهم لا يعقلون
en: And if thou wert to ask them: Who causeth water to come down from the sky, and therewith reviveth the earth after its death? they verily would say: Allah. Say: Praise be to Allah! But most of them have no sense.

source: وما هذه الحياة الدنيا إلا لهو ولعب وإن الدار الآخرة لهي الحيوان لو كانوا يعلمون
en: This life of the world is but a pastime and a game. Lo! the home of the Hereafter - that is Life, if they but knew.

source: فإذا ركبوا في الفلك دعوا الله مخلصين له الدين فلما نجاهم إلى البر إذا هم يشركون
en: And when they mount upon the ships they pray to Allah, making their faith pure for Him only, but when He bringeth them safe to land, behold! they ascribe partners (unto Him),

source: ليكفروا بما آتيناهم وليتمتعوا فسوف يعلمون
en: That they may disbelieve in that which We have given them, and that they may take their ease. But they will come to know.

source: أولم يروا أنا جعلنا حرما آمنا ويتخطف الناس من حولهم أفبالباطل يؤمنون وبنعمة الله يكفرون
en: Have they not seen that We have appointed a sanctuary immune (from violence), while mankind are ravaged all around them? Do they then believe in falsehood and disbelieve in the bounty of Allah?

source: ومن أظلم ممن افترى على الله كذبا أو كذب بالحق لما جاءه أليس في جهنم مثوى للكافرين
en: Who doeth greater wrong than he who inventeth a lie concerning Allah, or denieth the truth when it cometh unto him? Is not there a home in hell for disbelievers?

source: والذين جاهدوا فينا لنهدينهم سبلنا وإن الله لمع المحسنين
en: As for those who strive in Us, We surely guide them to Our paths, and lo! Allah is with the good.

source: غلبت الروم
en: The Romans have been defeated

source: في أدنى الأرض وهم من بعد غلبهم سيغلبون
en: In the nearer land, and they, after their defeat will be victorious

source: في بضع سنين لله الأمر من قبل ومن بعد ويومئذ يفرح المؤمنون
en: Within ten years - Allah's is the command in the former case and in the latter - and in that day believers will rejoice

source: بنصر الله ينصر من يشاء وهو العزيز الرحيم
en: In Allah's help to victory. He helpeth to victory whom He will. He is the Mighty, the Merciful.

source: وعد الله لا يخلف الله وعده ولكن أكثر الناس لا يعلمون
en: It is a promise of Allah. Allah faileth not His promise, but most of mankind know not.

source: يعلمون ظاهرا من الحياة الدنيا وهم عن الآخرة هم غافلون
en: They know only some appearance of the life of the world, and are heedless of the Hereafter.

source: أولم يتفكروا في أنفسهم ما خلق الله السماوات والأرض وما بينهما إلا بالحق وأجل مسمى وإن كثيرا من الناس بلقاء ربهم لكافرون
en: Have they not pondered upon themselves? Allah created not the heavens and the earth, and that which is between them, save with truth and for a destined end. But truly many of mankind are disbelievers in the meeting with their Lord.

source: أولم يسيروا في الأرض فينظروا كيف كان عاقبة الذين من قبلهم كانوا أشد منهم قوة وأثاروا الأرض وعمروها أكثر مما عمروها وجاءتهم رسلهم بالبينات فما كان الله ليظلمهم ولكن كانوا أنفسهم يظلمون
en: Have they not travelled in the land and seen the nature of the consequence for those who were before them? They were stronger than these in power, and they dug the earth and built upon it more than these have built. Messengers of their own came unto them with clear proofs (of Allah's Sovereignty). Surely Allah wronged them not, but they did wrong themselves.

source: ثم كان عاقبة الذين أساءوا السوأى أن كذبوا بآيات الله وكانوا بها يستهزئون
en: Then evil was the consequence to those who dealt in evil, because they denied the revelations of Allah and made a mock of them.

source: الله يبدأ الخلق ثم يعيده ثم إليه ترجعون
en: Allah produceth creation, then He reproduceth it, then unto Him ye will be returned.

source: ويوم تقوم الساعة يبلس المجرمون
en: And in the day when the Hour riseth the unrighteous will despair.

source: ولم يكن لهم من شركائهم شفعاء وكانوا بشركائهم كافرين
en: There will be none to intercede for them of those whom they made equal with Allah. And they will reject their partners (whom they ascribed unto Him).

source: ويوم تقوم الساعة يومئذ يتفرقون
en: In the day when the Hour cometh, in that day they will be sundered.

source: فأما الذين آمنوا وعملوا الصالحات فهم في روضة يحبرون
en: As for those who believed and did good works, they will be made happy in a Garden.

source: وأما الذين كفروا وكذبوا بآياتنا ولقاء الآخرة فأولئك في العذاب محضرون
en: But as for those who disbelieved and denied Our revelations, and denied the meeting of the Hereafter, such will be brought to doom.

source: فسبحان الله حين تمسون وحين تصبحون
en: So glory be to Allah when ye enter the night and when ye enter the morning -

source: وله الحمد في السماوات والأرض وعشيا وحين تظهرون
en: Unto Him be praise in the heavens and the earth! - and at the sun's decline and in the noonday.

source: يخرج الحي من الميت ويخرج الميت من الحي ويحيي الأرض بعد موتها وكذلك تخرجون
en: He bringeth forth the living from the dead, and He bringeth forth the dead from the living, and He reviveth the earth after her death. And even so will ye be brought forth.

source: ومن آياته أن خلقكم من تراب ثم إذا أنتم بشر تنتشرون
en: And of His signs is this: He created you of dust, and behold you human beings, ranging widely!

source: ومن آياته أن خلق لكم من أنفسكم أزواجا لتسكنوا إليها وجعل بينكم مودة ورحمة إن في ذلك لآيات لقوم يتفكرون
en: And of His signs is this: He created for you helpmeets from yourselves that ye might find rest in them, and He ordained between you love and mercy. Lo! herein indeed are portents for folk who reflect.

source: ومن آياته خلق السماوات والأرض واختلاف ألسنتكم وألوانكم إن في ذلك لآيات للعالمين
en: And of His signs is the creation of the heavens and the earth, and the difference of your languages and colours. Lo! herein indeed are portents for men of knowledge.

source: ومن آياته منامكم بالليل والنهار وابتغاؤكم من فضله إن في ذلك لآيات لقوم يسمعون
en: And of His signs is your slumber by night and by day, and your seeking of His bounty. Lo! herein indeed are portents for folk who heed.

source: ومن آياته يريكم البرق خوفا وطمعا وينزل من السماء ماء فيحيي به الأرض بعد موتها إن في ذلك لآيات لقوم يعقلون
en: And of His signs is this: He showeth you the lightning for a fear and for a hope, and sendeth down water from the sky, and thereby quickeneth the earth after her death. Lo! herein indeed are portents for folk who understand.

source: ومن آياته أن تقوم السماء والأرض بأمره ثم إذا دعاكم دعوة من الأرض إذا أنتم تخرجون
en: And of His signs is this: The heavens and the earth stand fast by His command, and afterward, when He calleth you, lo! from the earth ye will emerge.

source: وله من في السماوات والأرض كل له قانتون
en: Unto Him belongeth whosoever is in the heavens and the earth. All are obedient unto Him.

source: وهو الذي يبدأ الخلق ثم يعيده وهو أهون عليه وله المثل الأعلى في السماوات والأرض وهو العزيز الحكيم
en: He it is Who produceth creation, then reproduceth it, and it is easier for Him. His is the Sublime Similitude in the heavens and the earth. He is the Mighty, the Wise.

source: ضرب لكم مثلا من أنفسكم هل لكم من ما ملكت أيمانكم من شركاء في ما رزقناكم فأنتم فيه سواء تخافونهم كخيفتكم أنفسكم كذلك نفصل الآيات لقوم يعقلون
en: He coineth for you a similitude of yourselves. Have ye, from among those whom your right hands possess, partners in the wealth We have bestowed upon you, equal with you in respect thereof, so that ye fear them as ye fear each other (that ye ascribe unto Us partners out of that which We created)? Thus We display the revelations for people who have sense.

source: بل اتبع الذين ظلموا أهواءهم بغير علم فمن يهدي من أضل الله وما لهم من ناصرين
en: Nay, but those who do wrong follow their own lusts without knowledge. Who is able to guide him whom Allah hath sent astray? For such there are no helpers.

source: فأقم وجهك للدين حنيفا فطرت الله التي فطر الناس عليها لا تبديل لخلق الله ذلك الدين القيم ولكن أكثر الناس لا يعلمون
en: So set thy purpose (O Muhammad) for religion as a man by nature upright - the nature (framed) of Allah, in which He hath created man. There is no altering (the laws of) Allah's creation. That is the right religion, but most men know not -

source: منيبين إليه واتقوه وأقيموا الصلاة ولا تكونوا من المشركين
en: Turning unto Him (only); and be careful of your duty unto Him and establish worship, and be not of those who ascribe partners (unto Him);

source: من الذين فرقوا دينهم وكانوا شيعا كل حزب بما لديهم فرحون
en: Of those who split up their religion and became schismatics, each sect exulting in its tenets.

source: وإذا مس الناس ضر دعوا ربهم منيبين إليه ثم إذا أذاقهم منه رحمة إذا فريق منهم بربهم يشركون
en: And when harm toucheth men they cry unto their Lord, turning to Him in repentance; then, when they have tasted of His mercy, behold! some of them attribute partners to their Lord

source: أم أنزلنا عليهم سلطانا فهو يتكلم بما كانوا به يشركون
en: Or have We revealed unto them any warrant which speaketh of that which they associate with Him?

source: وإذا أذقنا الناس رحمة فرحوا بها وإن تصبهم سيئة بما قدمت أيديهم إذا هم يقنطون
en: And when We cause mankind to taste of mercy they rejoice therein; but if an evil thing befall them as the consequence of their own deeds, lo! they are in despair!

source: أولم يروا أن الله يبسط الرزق لمن يشاء ويقدر إن في ذلك لآيات لقوم يؤمنون
en: See they not that Allah enlargeth the provision for whom He will, and straiteneth (it for whom He will). Lo! herein indeed are portents for folk who believe.

source: فآت ذا القربى حقه والمسكين وابن السبيل ذلك خير للذين يريدون وجه الله وأولئك هم المفلحون
en: So give to the kinsman his due, and to the needy, and to the wayfarer. That is best for those who seek Allah's Countenance. And such are they who are successful.

source: وما آتيتم من ربا ليربو في أموال الناس فلا يربو عند الله وما آتيتم من زكاة تريدون وجه الله فأولئك هم المضعفون
en: That which ye give in usury in order that it may increase on (other) people's property hath no increase with Allah; but that which ye give in charity, seeking Allah's Countenance, hath increase manifold.

source: الله الذي خلقكم ثم رزقكم ثم يميتكم ثم يحييكم هل من شركائكم من يفعل من ذلكم من شيء سبحانه وتعالى عما يشركون
en: Allah is He Who created you and then sustained you, then causeth you to die, then giveth life to you again. Is there any of your (so-called) partners (of Allah) that doeth aught of that? Praised and Exalted be He above what they associate (with Him)!

source: ظهر الفساد في البر والبحر بما كسبت أيدي الناس ليذيقهم بعض الذي عملوا لعلهم يرجعون
en: Corruption doth appear on land and sea because of (the evil) which men's hands have done, that He may make them taste a part of that which they have done, in order that they may return.

source: قل سيروا في الأرض فانظروا كيف كان عاقبة الذين من قبل كان أكثرهم مشركين
en: Say (O Muhammad, to the disbelievers): Travel in the land, and see the nature of the consequence for those who were before you! Most of them were idolaters.

source: فأقم وجهك للدين القيم من قبل أن يأتي يوم لا مرد له من الله يومئذ يصدعون
en: So set thy purpose resolutely for the right religion, before the inevitable day cometh from Allah. On that day mankind will be sundered-

source: من كفر فعليه كفره ومن عمل صالحا فلأنفسهم يمهدون
en: Whoso disbelieveth must (then) bear the consequences of his disbelief, while those who do right make provision for themselves -

source: ليجزي الذين آمنوا وعملوا الصالحات من فضله إنه لا يحب الكافرين
en: That He may reward out of His bounty those who believe and do good works. Lo! He loveth not the disbelievers (in His guidance).
